<div class="introduction">
    <div class="title"><p>| 序論</p></div>
    <div class="grid reverse">
        <div class="item article">
            <p>
                &nbsp;&nbsp;&nbsp;文部科学省は, 2022年度から全国の高校で
                “総合的な探究の時間”を実施している。 “総合的な探究” は,
                “探究的な学習” と “協働的な学習”
                で構成されている.　“協働的な学習” とは,
                他者と協同して課題を解決しようとする学習活動であり,
                そこで重要なのは,
                異なる個性をもつ者同士で問題の解決に向かうことである.　また,
                それぞれのスキルを最大限に活かして活動することも重要である.　これらの点からまず,
                自ら仲間を探し, 共に探究を進めることにした.　そこで私たちは,
                問題の解決を円滑に進めるために人との繋がりが鍵になると考え,
                ネットワークを使って個人のスキルを共有することで,
                チームを組みやすくできないかと考えた.　自ら学びながら仲間が相互に教え合い,
                さまざまなことに取り組むスタイルは,
                私たちが考える新しい学習方法だと考え,
                自分にはないスキルを持った仲間を探すためのサイトを作っていく.
            </p>
        </div>
        <div class="item image">
            <img
                src="https://uploads-ssl.webflow.com/603c87adb15be3cb0b3ed9b5/60f95161b382b3c00f3b3057_80_cat_box_ol.png"
                height="200"
                alt=""
            />
        </div>
    </div>
</div>

<style lang="scss">
    @use "./articles.scss";
</style>
