<script lang="ts">
    import { isLoading } from "$lib/model/store";
    import Button, { Icon, Label } from "@smui/button";
    import { onMount } from "svelte";

    onMount(() => {
        isLoading.set(false);
    });

    let status = "";
</script>

<div class="top-view">
    <div class="top-content">
        <div class="text-container">
            <div class="center-title">
                <p> 校内でのスキルネットワークの制作 </p>
            </div>
            <div class="subtitle"> <p>ちーむ: あ い う え</p> </div>
        </div>
        <div class="img-container">
            <img
                src="https://uploads-ssl.webflow.com/603c87adb15be3cb0b3ed9b5/60f95161b382b3c00f3b3057_80_cat_box_ol.png"
                height="200"
            />
        </div>
    </div>
</div>
<div class="main">
    <p>
        日頃から、こんなスキルを持った人がいないかな、こんな仲間がいたらなと感じていました。<br
        />
        そこで、コンピュータの技術を使って、仲間集めが出来ないかと考えました。それがスキールネットです。<br
        />
        自分にはないスキルを持った仲間を探すためのサイトを作り、自分で使用するだけではなく、<br
        />
        多くの人にもサイトの作り方を資料として公開し、問題の解決に繋げたいと思いました。<br
        />
        企業や社会人向けにはスキルのデータベースのようなものがあるかもしれませんが、学生にはないことに疑問を感じていました。<br
        />
        だからこそ学生のための学生が必要とする項目を作成し、より目的の人材にたどり着けるように募集設定に工夫をするつもりです。<br
        />
        また、部活動や探究活動以外にも、テスト対策など生徒同士で気軽に使用できるようにするつもりです。<br
        />
        自ら学びながら、仲間が相互に教え合い、様々なことに取り組むスタイルは、これからの新しい学習方法だと考えます。<br
        />
        そのための最適な解決方法がスキールネットです<br />
    </p>
    <p>
        日頃から、こんなスキルを持った人がいないかな、こんな仲間がいたらなと感じていました。<br
        />
        そこで、コンピュータの技術を使って、仲間集めが出来ないかと考えました。それがスキールネットです。<br
        />
        自分にはないスキルを持った仲間を探すためのサイトを作り、自分で使用するだけではなく、<br
        />
        多くの人にもサイトの作り方を資料として公開し、問題の解決に繋げたいと思いました。<br
        />
        企業や社会人向けにはスキルのデータベースのようなものがあるかもしれませんが、学生にはないことに疑問を感じていました。<br
        />
        だからこそ学生のための学生が必要とする項目を作成し、より目的の人材にたどり着けるように募集設定に工夫をするつもりです。<br
        />
        また、部活動や探究活動以外にも、テスト対策など生徒同士で気軽に使用できるようにするつもりです。<br
        />
        自ら学びながら、仲間が相互に教え合い、様々なことに取り組むスタイルは、これからの新しい学習方法だと考えます。<br
        />
        そのための最適な解決方法がスキールネットです<br />
    </p>
    <p>
        日頃から、こんなスキルを持った人がいないかな、こんな仲間がいたらなと感じていました。<br
        />
        そこで、コンピュータの技術を使って、仲間集めが出来ないかと考えました。それがスキールネットです。<br
        />
        自分にはないスキルを持った仲間を探すためのサイトを作り、自分で使用するだけではなく、<br
        />
        多くの人にもサイトの作り方を資料として公開し、問題の解決に繋げたいと思いました。<br
        />
        企業や社会人向けにはスキルのデータベースのようなものがあるかもしれませんが、学生にはないことに疑問を感じていました。<br
        />
        だからこそ学生のための学生が必要とする項目を作成し、より目的の人材にたどり着けるように募集設定に工夫をするつもりです。<br
        />
        また、部活動や探究活動以外にも、テスト対策など生徒同士で気軽に使用できるようにするつもりです。<br
        />
        自ら学びながら、仲間が相互に教え合い、様々なことに取り組むスタイルは、これからの新しい学習方法だと考えます。<br
        />
        そのための最適な解決方法がスキールネットです<br />
    </p>
    <p>ホームかも</p>
    <Button variant="raised">
        <Label>ステータスを取得</Label>
    </Button>
</div>

<style lang="scss">
    .top-view {
        height: 97vh;
        display: flex;
        align-items: center;
        justify-content: center;
        padding: 40px;

        .top-content {
            width: 100%;
            height: 100%;
            padding: 20px;
            background-color: aqua;

            .text-container {
                text-align: center;

                .center-title {
                    p {
                        font-weight: 900;
                        font-size: 40px;
                        color: var(--m3-primary);
                    }
                }
            }

            .img-container img {
                display: block;
                margin-left: auto;
            }
        }
    }
</style>
